# Этот файл будет содержать глобальные переменные, доступные для всех модулей.

# Изначально устанавливаем значение None
SELECTED_SHEET_NAME = None

# Добавляем c4_tech_data в global_word_book.py
c4_tech_data = [


    ['Предоставление пространства имен на кластере Kubernetes (услуга 2.1.2)'], ['2.1.2', 1],
    ['Предоставление пространства имен на кластере Kubernetes (услуга 2.1.2)'], ['2.1.2', 1],
    ['Услуга многоуровневой защиты веб-приложений от кибератак прикладного уровня (услуга 3.2.1)'], ['3.2.1', 1],
    ['Услуга защиты web-приложений от DDoS атак (услуга 3.2.2)'], ['3.2.2', 1],
    ['Предоставление виртуальной машины (услуга 2.1.1)'], ['2.1.1', 4],
    ['Средство антивирусной защиты (услуга 2.18.27)'], ['2.18.27', 4],
    ['Услуга по мониторингу, выявлению и активному реагированию на инциденты информационной безопасности (услуга 3.2.5)'], ['3.2.5', 1],
    ['Сопровождение средства защиты от НСД (услуга 3.1.18)'], ['3.1.18', 4],
    ['Сервисы управления очередями сообщений (услуга 1.10)'], ['1.10', 1],
    ['Сервис транзакционной СУБД (услуга 1.1)'], ['1.1', 1],
    ['Предоставление инфраструктурного сервиса, обеспечивающего взаимодействие с ядром платформы (услуга 2.19.2)'], ['2.19.2', 1],
    ['Комплект средств криптографической защиты информации для агента ПОДД (услуга 2.18.35)'], ['2.18.35', 1],
    ['Сервис транзакционной СУБД (услуга 1.1)'], ['1.1', 1],
    ['Сервис управления процессами (1.12)'], ['1.12', 1, 'Электронная подпись Platform V Secret Management'],
    ['Выделение места (услуга 2.1.3)'], ['2.1.3', 1],
    ['Сервис IAM (услуга 1.13)'], ['1.13', 1],
    ['Сервис «Шлюз Единой системы идентификации и аутентификации» (услуга 1.19)'], ['1.19', 1],
    ['Сервис аудита (услуга 1.15)'], ['1.15', 1],
    ['Сервис журналирования (услуга 1.14)'], ['1.14', 1],
    ['Сервис мониторинга (услуга 1.16)'], ['1.16', 1],
    ['Средство автоматизированного формирования и проверки электронной подписи КС2 (услуга 2.18.34)'], ['2.18.34', 1],
    ['Сопровождение комплекта средств контроля действий привилегированных пользователей тип 2 (услуга 3.1.25)'], ['3.1.25', 1],
]